espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG22/Include/efr32fg22_cmu.h
/* Bit fields for CMU CLKEN1 */
#define _CMU_CLKEN1_RESETVALUE                     0x00000000UL                            /**< Default value for CMU_CLKEN1                */
#define _CMU_CLKEN1_MASK                           0x0007FFFFUL                            /**< Mask for CMU_CLKEN1                         */
#define CMU_CLKEN1_AGC                             (0x1UL << 0)                            /**< Enable Bus Clock                            */
#define _CMU_CLKEN1_AGC_SHIFT                      0                                       /**< Shift value for CMU_AGC                     */
#define _CMU_CLKEN1_AGC_MASK                       0x1UL                                   /**< Bit mask for CMU_AGC                        */
#define _CMU_CLKEN1_AGC_DEFAULT                    0x00000000UL                            /**< Mode DEFAULT for CMU_CLKEN1                 */
#define CMU_CLKEN1_AGC_DEFAULT                     (_CMU_CLKEN1_AGC_DEFAULT << 0)          /**< Shifted mode DEFAULT for CMU_CLKEN1         */
#define CMU_CLKEN1_MODEM                           (0x1UL << 1)                            /**< Enable Bus Clock                            */
#define _CMU_CLKEN1_MODEM_SHIFT                    1                                       /**< Shift value for CMU_MODEM                   */
#define _CMU_CLKEN1_MODEM_MASK                     0x2UL                                   /**< Bit mask for CMU_MODEM                      */
#define _CMU_CLKEN1_MODEM_DEFAULT                  0x00000000UL                            /**< Mode DEFAULT for CMU_CLKEN1                 */
#define CMU_CLKEN1_MODEM_DEFAULT                   (_CMU_CLKEN1_MODEM_DEFAULT << 1)        /**< Shifted mode DEFAULT for CMU_CLKEN1         */
#define CMU_CLKEN1_RFCRC                           (0x1UL << 2)                            /**< Enable Bus Clock                            */
#define _CMU_CLKEN1_RFCRC_SHIFT                    2                                       /**< Shift value for CMU_RFCRC                   */
#define _CMU_CLKEN1_RFCRC_MASK                     0x4UL                                   /**< Bit mask for CMU_RFCRC                      */
#define _CMU_CLKEN1_RFCRC_DEFAULT                  0x00000000UL                            /**< Mode DEFAULT for CMU_CLKEN1                 */
#define CMU_CLKEN1_RFCRC_DEFAULT                   (_CMU_CLKEN1_RFCRC_DEFAULT << 2)        /**< Shifted mode DEFAULT for CMU_CLKEN1         */
#define CMU_CLKEN1_FRC                             (0x1UL << 3)                            /**< Enable Bus Clock                            */
#define _CMU_CLKEN1_FRC_SHIFT                      3                                       /**< Shift value for CMU_FRC                     */
#define _CMU_CLKEN1_FRC_MASK                       0x8UL                                   /**< Bit mask for CMU_FRC                        */
#define _CMU_CLKEN1_FRC_DEFAULT                    0x00000000UL                            /**< Mode DEFAULT for CMU_CLKEN1                 */
#define CMU_CLKEN1_FRC_DEFAULT                     (_CMU_CLKEN1_FRC_DEFAULT << 3)          /**< Shifted mode DEFAULT for CMU_CLKEN1         */
#define CMU_CLKEN1_PROTIMER                        (0x1UL << 4)                            /**< Enable Bus Clock                            */
#define _CMU_CLKEN1_PROTIMER_SHIFT                 4                                       /**< Shift value for CMU_PROTIMER                */
#define _CMU_CLKEN1_PROTIMER_MASK                  0x10UL                                  /**< Bit mask for CMU_PROTIMER                   */
#define _CMU_CLKEN1_PROTIMER_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for CMU_CLKEN1                 */
#define CMU_CLKEN1_PROTIMER_DEFAULT                (_CMU_CLKEN1_PROTIMER_DEFAULT << 4)     /**< Shifted mode DEFAULT for CMU_CLKEN1         */
#define CMU_CLKEN1_RAC                             (0x1UL << 5)                            /**< Enable Bus Clock                            */
#define _CMU_CLKEN1_RAC_SHIFT                      5                                       /**< Shift value for CMU_RAC                     */
#define _CMU_CLKEN1_RAC_MASK                       0x20UL                                  /**< Bit mask for CMU_RAC                        */
#define _CMU_CLKEN1_RAC_DEFAULT                    0x00000000UL                            /**< Mode DEFAULT for CMU_CLKEN1                 */
#define CMU_CLKEN1_RAC_DEFAULT                     (_CMU_CLKEN1_RAC_DEFAULT << 5)          /**< Shifted mode DEFAULT for CMU_CLKEN1         */
#define CMU_CLKEN1_SYNTH                           (0x1UL << 6)                            /**< Enable Bus Clock                            */
#define _CMU_CLKEN1_SYNTH_SHIFT                    6                                       /**< Shift value for CMU_SYNTH                   */
#define _CMU_CLKEN1_SYNTH_MASK                     0x40UL                                  /**< Bit mask for CMU_SYNTH                      */
#define _CMU_CLKEN1_SYNTH_DEFAULT                  0x00000000UL                            /**< Mode DEFAULT for CMU_CLKEN1                 */
#define CMU_CLKEN1_SYNTH_DEFAULT                   (_CMU_CLKEN1_SYNTH_DEFAULT << 6)        /**< Shifted mode DEFAULT for CMU_CLKEN1         */
#define CMU_CLKEN1_RDSCRATCHPAD                    (0x1UL << 7)                            /**< Enable Bus Clock                            */
#define _CMU_CLKEN1_RDSCRATCHPAD_SHIFT             7                                       /**< Shift value for CMU_RDSCRATCHPAD            */
#define _CMU_CLKEN1_RDSCRATCHPAD_MASK              0x80UL                                  /**< Bit mask for CMU_RDSCRATCHPAD               */
#define _CMU_CLKEN1_RDSCRATCHPAD_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for CMU_CLKEN1                 */
#define CMU_CLKEN1_RDSCRATCHPAD_DEFAULT            (_CMU_CLKEN1_RDSCRATCHPAD_DEFAULT << 7) /**< Shifted mode DEFAULT for CMU_CLKEN1         */
#define CMU_CLKEN1_RDMAILBOX0                      (0x1UL << 8)                            /**< Enable Bus Clock                            */
#define _CMU_CLKEN1_RDMAILBOX0_SHIFT               8                                       /**< Shift value for CMU_RDMAILBOX0              */
#define _CMU_CLKEN1_RDMAILBOX0_MASK                0x100UL                                 /**< Bit mask for CMU_RDMAILBOX0                 */
#define _CMU_CLKEN1_RDMAILBOX0_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for CMU_CLKEN1                 */
#define CMU_CLKEN1_RDMAILBOX0_DEFAULT              (_CMU_CLKEN1_RDMAILBOX0_DEFAULT << 8)   /**< Shifted mode DEFAULT for CMU_CLKEN1         */
#define CMU_CLKEN1_RDMAILBOX1                      (0x1UL << 9)                            /**< Enable Bus Clock                            */
#define _CMU_CLKEN1_RDMAILBOX1_SHIFT               9                                       /**< Shift value for CMU_RDMAILBOX1              */
#define _CMU_CLKEN1_RDMAILBOX1_MASK                0x200UL                                 /**< Bit mask for CMU_RDMAILBOX1                 */
#define _CMU_CLKEN1_RDMAILBOX1_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for CMU_CLKEN1                 */
#define CMU_CLKEN1_RDMAILBOX1_DEFAULT              (_CMU_CLKEN1_RDMAILBOX1_DEFAULT << 9)   /**< Shifted mode DEFAULT for CMU_CLKEN1         */
#define CMU_CLKEN1_PRORTC                          (0x1UL << 10)                           /**< Enable Bus Clock                            */
#define _CMU_CLKEN1_PRORTC_SHIFT                   10                                      /**< Shift value for CMU_PRORTC                  */
#define _CMU_CLKEN1_PRORTC_MASK                    0x400UL                                 /**< Bit mask for CMU_PRORTC                     */
#define _CMU_CLKEN1_PRORTC_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for CMU_CLKEN1                 */
#define CMU_CLKEN1_PRORTC_DEFAULT                  (_CMU_CLKEN1_PRORTC_DEFAULT << 10)      /**< Shifted mode DEFAULT for CMU_CLKEN1         */
#define CMU_CLKEN1_BUFC                            (0x1UL << 11)                           /**< Enable Bus Clock                            */
#define _CMU_CLKEN1_BUFC_SHIFT                     11                                      /**< Shift value for CMU_BUFC                    */
#define _CMU_CLKEN1_BUFC_MASK                      0x800UL                                 /**< Bit mask for CMU_BUFC                       */
#define _CMU_CLKEN1_BUFC_DEFAULT                   0x00000000UL                            /**< Mode DEFAULT for CMU_CLKEN1                 */
#define CMU_CLKEN1_BUFC_DEFAULT                    (_CMU_CLKEN1_BUFC_DEFAULT << 11)        /**< Shifted mode DEFAULT for CMU_CLKEN1         */
#define CMU_CLKEN1_IFADCDEBUG                      (0x1UL << 12)                           /**< Enable Bus Clock                            */
#define _CMU_CLKEN1_IFADCDEBUG_SHIFT               12                                      /**< Shift value for CMU_IFADCDEBUG              */
#define _CMU_CLKEN1_IFADCDEBUG_MASK                0x1000UL                                /**< Bit mask for CMU_IFADCDEBUG                 */
#define _CMU_CLKEN1_IFADCDEBUG_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for CMU_CLKEN1                 */
#define CMU_CLKEN1_IFADCDEBUG_DEFAULT              (_CMU_CLKEN1_IFADCDEBUG_DEFAULT << 12)  /**< Shifted mode DEFAULT for CMU_CLKEN1         */
#define CMU_CLKEN1_CRYPTOACC                       (0x1UL << 13)                           /**< Enable Bus Clock                            */
#define _CMU_CLKEN1_CRYPTOACC_SHIFT                13                                      /**< Shift value for CMU_CRYPTOACC               */
#define _CMU_CLKEN1_CRYPTOACC_MASK                 0x2000UL                                /**< Bit mask for CMU_CRYPTOACC                  */
#define _CMU_CLKEN1_CRYPTOACC_DEFAULT              0x00000000UL                            /**< Mode DEFAULT for CMU_CLKEN1                 */
#define CMU_CLKEN1_CRYPTOACC_DEFAULT               (_CMU_CLKEN1_CRYPTOACC_DEFAULT << 13)   /**< Shifted mode DEFAULT for CMU_CLKEN1         */
#define CMU_CLKEN1_RFSENSE                         (0x1UL << 14)                           /**< Enable Bus Clock                            */
#define _CMU_CLKEN1_RFSENSE_SHIFT                  14                                      /**< Shift value for CMU_RFSENSE                 */
#define _CMU_CLKEN1_RFSENSE_MASK                   0x4000UL                                /**< Bit mask for CMU_RFSENSE                    */
#define _CMU_CLKEN1_RFSENSE_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for CMU_CLKEN1                 */
#define CMU_CLKEN1_RFSENSE_DEFAULT                 (_CMU_CLKEN1_RFSENSE_DEFAULT << 14)     /**< Shifted mode DEFAULT for CMU_CLKEN1         */
#define CMU_CLKEN1_SMU                             (0x1UL << 15)                           /**< Enable Bus Clock                            */
#define _CMU_CLKEN1_SMU_SHIFT                      15                                      /**< Shift value for CMU_SMU                     */
#define _CMU_CLKEN1_SMU_MASK                       0x8000UL                                /**< Bit mask for CMU_SMU                        */
#define _CMU_CLKEN1_SMU_DEFAULT                    0x00000000UL                            /**< Mode DEFAULT for CMU_CLKEN1                 */
#define CMU_CLKEN1_SMU_DEFAULT                     (_CMU_CLKEN1_SMU_DEFAULT << 15)         /**< Shifted mode DEFAULT for CMU_CLKEN1         */
#define CMU_CLKEN1_ICACHE0                         (0x1UL << 16)                           /**< Enable Bus Clock                            */
#define _CMU_CLKEN1_ICACHE0_SHIFT                  16                                      /**< Shift value for CMU_ICACHE0                 */
#define _CMU_CLKEN1_ICACHE0_MASK                   0x10000UL                               /**< Bit mask for CMU_ICACHE0                    */
#define _CMU_CLKEN1_ICACHE0_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for CMU_CLKEN1                 */
#define CMU_CLKEN1_ICACHE0_DEFAULT                 (_CMU_CLKEN1_ICACHE0_DEFAULT << 16)     /**< Shifted mode DEFAULT for CMU_CLKEN1         */
#define CMU_CLKEN1_MSC                             (0x1UL << 17)                           /**< Enable Bus Clock                            */
#define _CMU_CLKEN1_MSC_SHIFT                      17                                      /**< Shift value for CMU_MSC                     */
#define _CMU_CLKEN1_MSC_MASK                       0x20000UL                               /**< Bit mask for CMU_MSC                        */
#define _CMU_CLKEN1_MSC_DEFAULT                    0x00000000UL                            /**< Mode DEFAULT for CMU_CLKEN1                 */
#define CMU_CLKEN1_MSC_DEFAULT                     (_CMU_CLKEN1_MSC_DEFAULT << 17)         /**< Shifted mode DEFAULT for CMU_CLKEN1         */
#define CMU_CLKEN1_TIMER4                          (0x1UL << 18)                           /**< Enable Bus Clock                            */
#define _CMU_CLKEN1_TIMER4_SHIFT                   18                                      /**< Shift value for CMU_TIMER4                  */
#define _CMU_CLKEN1_TIMER4_MASK                    0x40000UL                               /**< Bit mask for CMU_TIMER4                     */
#define _CMU_CLKEN1_TIMER4_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for CMU_CLKEN1                 */
#define CMU_CLKEN1_TIMER4_DEFAULT                  (_CMU_CLKEN1_TIMER4_DEFAULT << 18)      /**< Shifted mode DEFAULT for CMU_CLKEN1         */

